# ProductIsRS Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..ProductIsRS Property
UIControlledApplication Class See Also
---
Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool ProductIsRS { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProductIsRS As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ProductIsRS {
	bool get ();
}
```

# See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace